Tekla.Structures.Model.LoadPoint
The LoadPoint class defines a concentrated force or a bending moment.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam FatherBeam = new Beam(new Point(3000,6000,0), new Point(4000,6000,0));
if (!FatherBeam.Insert())
Console.WriteLine("Father Beam Insert failed!");
LoadPoint L = new LoadPoint();
L.P = new Vector(3000,4000,5000);
L.Moment = new Vector(6000,7000,8000);
L.Position = new Point(3000,6000,0);
L.FatherId = FatherBeam.Identifier;
L.AutomaticPrimaryAxisWeight = true;
L.BoundingBoxDx = 500;
L.BoundingBoxDy = 500;
L.BoundingBoxDz = 500;
L.LoadDispersionAngle = 1;
L.PartFilter = "testing";
L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
L.PrimaryAxisDirection = new Vector(1000, 500, 0);
L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
L.Weight = 2;
L.CreateFixedSupportConditionsAutomatically = true;
if (!L.Insert())
Console.WriteLine("LoadPoint Insert failed!");
}
}

Tekla.Structures.Model.LoadPoint.Position
The position.

Tekla.Structures.Model.LoadPoint.P
The load vector.
The values are given in the local coordinate system of the load (not in the current coordinate system).

Tekla.Structures.Model.LoadPoint.Moment
The moment vector.
The values are given in the local coordinate system of the load (not in the current coordinate system).

Tekla.Structures.Model.LoadPoint.#ctor
Creates a new load point instance.

Tekla.Structures.Model.LoadPoint.Insert
Inserts the load point into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadPoint.Select
Selects a load point from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.LoadPoint.Modify
Modifies the existing load point in the model database to match the current one.
At the moment it is not possible to change the load attachment or the father.
Returns: True on success.

Tekla.Structures.Model.LoadPoint.Delete
Deletes the load point instance with the given ID from the model database.
Returns: True on success.